Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateRevealIntegralError Property
 Could not create integral reveal for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRevealIntegralError { get; }
Public Shared ReadOnly Property CannotCreateRevealIntegralError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRevealIntegralError {
	FailureDefinitionId^ get ();
}
static member CannotCreateRevealIntegralError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace